//
//  TermsConditionsController.swift
//  PalmTree
//
//  Created by SprintSols on 5/19/20.
//  Copyright © 2020 apple. All rights reserved.
//

import UIKit

class PrivacyController: UIViewController {


    //MARK:- Outlets
    @IBOutlet weak var lblTitle: UILabel!
    @IBOutlet weak var txtView: UITextView!
    //MARK:- View Life Cycle
    override func viewDidLoad() {
        super.viewDidLoad()
        
        if languageCode == "ar"
        {
            self.view.transform = CGAffineTransform(scaleX: -1.0, y: 1.0)
            lblTitle.transform = CGAffineTransform(scaleX: -1.0, y: 1.0)
            txtView.transform = CGAffineTransform(scaleX: -1.0, y: 1.0)
            txtView.text = "•    لكي يوفر التطبيق والموقع الإلكتروني خدمة آمنة ومفيدة، من المهم أن يقوم Palmtree Store بجمع المعلومات الشخصية واستخدامها ونشرها ومشاركتها.\n    •    المعلومات: المعلومات المنشورة على متجر Palmtree متاحة للجمهور. تقع خوادمنا في الولايات المتحدة والإمارات العربية المتحدة، لذلك، إذا اخترت تزويدنا بالمعلومات الشخصية، فأنت توافق على نقل هذه المعلومات ونشرها وتخزينها على خوادمنا في الولايات المتحدة والإمارات العربية المتحدة. نقوم بجمع ونشر وتخزين المعلومات الشخصية التالية:\n        •    عنوان البريد الإلكتروني، معلومات الاتصال، معلومات المستخدم، نشاط المستخدم، الصورة و (حسب الخدمة المستخدمة) المعلومات المالية في بعض الأحيان.\n     •    بيانات تسجيل الدخول على الكمبيوتر، وإحصاءات حول مشاهدات الصفحة، وحركة المرور من وإلى متجر Palmtree والاستجابة للإعلانات.\n   •    معلومات أخرى، بما في ذلك عنوان IP الخاص بالمستخدم ومعلومات سجل الويب القياسية.\n        •    الاستخدام: نستخدم المعلومات الشخصية للمستخدمين من أجل:\n•    تقديم خدماتنا\n\n    •    حل النزاعات وجمع الرسوم واستكشاف المشكلات وإصلاحها\n      •    المحافظة على التجارة الآمنة وتطبيق سياساتنا\n       •    التخصيص حسب تجربة المستخدمين ومعرفة مدى الاهتمام بخدماتنا، تحسين خدماتنا وإبلاغ المستخدمين بالخدمات والتحديثات•\n    توصيل العروض التسويقية والترويجية لك حسب تفضيلاتك\n   •    القيام بخدمات أخرى للمستخدمين كما هو موضح عندما نجمع المعلومات.\n  •    إفشاء المعلومات. نحن لا نبيع أو نؤجر معلومات المستخدمين الشخصية إلى أطراف ثالثة لأغراض التسويق الخاصة بهم دون موافقة صريحة من المستخدمين. يجوز لنا الكشف عن المعلومات الشخصية للاستجابة للمتطلبات القانونية، أو فرض سياساتنا، أو الرد على الادعاءات بأن النشر أو أي محتوى آخر ينتهك حقوق الآخرين، أو حماية حقوق أي شخص أو ممتلكاته أو سلامته.\n    •    أدوات الاتصال والبريد الإلكتروني. أنت توافق على تلقي اتصالات تسويقية حول السلع والخدمات الاستهلاكية نيابة عن شركاء الإعلانات التابعين لجهات خارجية ما لم تخبرنا أنك تفضل عدم تلقي هذه الاتصالات. إذا كنت لا ترغب في تلقي اتصالات تسويقية منا، فما عليك سوى الإشارة إلى تفضيلاتك باتباع التوجيهات المقدمة مع الاتصال. لا يجوز لك استخدام موقعنا أو أدوات الاتصال للحصول على العناوين أو إرسال البريد العشوائي أو خرق شروط الاستخدام أو سياسة الخصوصية. قد نقوم تلقائيًا بمسح رسائل البريد الإلكتروني المرسلة عبر أدوات الاتصال الخاصة بنا وتصفيتها يدويًا بحثًا عن نشاط ضار أو محتوى محظور. إذا كنت تستخدم أدواتنا لإرسال محتوى إلى صديق، فإننا لا نخزن عناوين أصدقائك بشكل دائم أو نستخدمها أو نكشف عنها لأغراض تسويقية. للإبلاغ عن البريد العشوائي من المستخدمين الآخرين، يرجى الاتصال بدعم العملاء.\n   •    الحماية. نستخدم الكثير من الأدوات (التشفير، كلمات المرور، الأمان المادي) لحماية معلوماتك الشخصية من الوصول غير المصرح به والإفصاح.\n    •    ستحتفظ الخدمة بكافة التفاصيل الإلكترونية الشخصية باستثناء تلك التي ترغب في الكشف عنها.\n  •    من غير المقبول الكشف عن معلومات الاتصال الخاصة بالآخرين من خلال الخدمة.\n   •    إذا انتهكت قوانين دولة الإمارات العربية المتحدة و / أو شروط استخدام الخدمة، فإنك تخسر حقوق الخصوصية الخاصة بك على معلوماتك الشخصية.\n  •    معلومات إلغاء الاشتراك: إذا كنت ترغب في أي وقت بإزالة معلوماتك من قواعد بياناتنا النشطة، يرجى الاتصال بنا. بالإضافة إلى ذلك، ستتمكن من إلغاء الاشتراك في أي وقت عن طريق النقر على رابط إلغاء الاشتراك في الجزء السفلي من جميع مراسلاتنا عبر البريد الإلكتروني.\n   •    حماية بطاقات الائتمان والمدينة/الخصم: يحمي متجر Palmtree معلومات بطاقة الائتمان والخصم أثناء الإرسال باستخدام (يرجى تقديم البروتوكول)، الذي يقوم بتشفير معلوماتك عند إرسالها عبر الإنترنت. لن يتم مشاركة تفاصيل بطاقة الائتمان أو بيعها لأي أطراف ثالثة. لن يتم جمع تفاصيل الائتمان أو تخزينها على خوادم متجر Palmtree."
            
            txtView.textAlignment = .right
        }
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
       
    }
    
    override func viewWillAppear(_ animated: Bool) {
        super.viewWillAppear(animated)
        self.navigationController?.isNavigationBarHidden = true
    }
    
    override var preferredStatusBarStyle: UIStatusBarStyle {
        return .lightContent
    }
    
    //MARK:- IBActions
   
    @IBAction func backBtnAction(_ sender: Any)
    {
        self.navigationController?.popViewController(animated: true)
    }
}
